Tekla Open API Reference for Tekla Structures 2025
AnalysisPartSpanningProperties.SpanningTypeEnum Enumeration
 The spanning types.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum SpanningTypeEnum
Public Enumeration SpanningTypeEnum
Members
Member name | Value | Description
SPANNING_TYPE_SINGLE | 1 |  The single spanning type.
SPANNING_TYPE_DOUBLE | 2 |  The double spanning type.
See Also
Reference
Tekla.Structures.Analysis Namespace